Autodesk.Revit.DB.Structure.AnalyticalProjectionType
Presets for given Analytical Projection.  Combined with AnalyticalDirection, this abstracts
Analytical Projections for all Structural Elements

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.Varies
Projection types are different at each end.

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.LocationLine
Location Line.

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.CenterOfCore
Center of wall core.

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.Default
Element-specific default value.

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.NotApplicable
None of the other projection types apply.

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.DatumPlane
Use a Datum Plane for projection (e.g., Grid, Level).

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.SketchCurve
For sketch-based analytical models.

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.Invalid
Set to a bad setting.  Should only be set at this very rarely (i.e., at initial creation).

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.AutoDetect
Auto-detect projections for analytical model.

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.SideTwo
Horizontally, corresponds to second side (e.g., exterior).

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.SideOne
Horizontally, corresponds to first side (e.g., interior).

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.Bottom
Vertically, bottom of physical model.

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.Center
Vertically, center of physical model.

Autodesk.Revit.DB.Structure.AnalyticalProjectionType.Top
Vertically, on top of physical model.